tests/Load/results/books_c100_r1000_20260202_133748.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /es/api/bible/books/RV1960
Document Length:        335921 bytes

Concurrency Level:      100
Time taken for tests:   93.087 seconds
Complete requests:      1000
Failed requests:        988
   (Connect: 0, Receive: 0, Length: 988, Exceptions: 0)
Non-2xx responses:      1000
Total transferred:      336111852 bytes
HTML transferred:       335907852 bytes
Requests per second:    10.74 [#/sec] (mean)
Time per request:       9308.738 [ms] (mean)
Time per request:       93.087 [ms] (mean, across all concurrent requests)
Transfer rate:          3526.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       1
Processing:   102 8844 1659.4   9315    9643
Waiting:       97 8839 1659.4   9311    9638
Total:        102 8844 1659.1   9315    9643

Percentage of the requests served within a certain time (ms)
  50%   9315
  66%   9353
  75%   9399
  80%   9417
  90%   9465
  95%   9533
  98%   9580
  99%   9593
 100%   9643 (longest request)