tests/Load/results/books_c10_r1000_20260202_132843.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/bible/books/RV1960
Document Length:        335919 bytes

Concurrency Level:      10
Time taken for tests:   94.247 seconds
Complete requests:      1000
Failed requests:        994
   (Connect: 0, Receive: 0, Length: 994, Exceptions: 0)
Non-2xx responses:      1000
Total transferred:      336125013 bytes
HTML transferred:       335889013 bytes
Requests per second:    10.61 [#/sec] (mean)
Time per request:       942.468 [ms] (mean)
Time per request:       94.247 [ms] (mean, across all concurrent requests)
Transfer rate:          3482.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    96  937  68.4    932    1071
Waiting:       92  933  68.3    928    1067
Total:         96  938  68.4    932    1071

Percentage of the requests served within a certain time (ms)
  50%    932
  66%    949
  75%    959
  80%    971
  90%    998
  95%   1025
  98%   1040
  99%   1052
 100%   1071 (longest request)