tests/Load/results/books_c50_r500_20260202_133237.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /es/api/bible/books/RV1960
Document Length:        335878 bytes

Concurrency Level:      50
Time taken for tests:   96.446 seconds
Complete requests:      500
Failed requests:        498
   (Connect: 0, Receive: 0, Length: 498, Exceptions: 0)
Non-2xx responses:      500
Total transferred:      168056253 bytes
HTML transferred:       167954253 bytes
Requests per second:    5.18 [#/sec] (mean)
Time per request:       9644.629 [ms] (mean)
Time per request:       192.893 [ms] (mean, across all concurrent requests)
Transfer rate:          1701.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:  4567 8962 851.5   9206    9358
Waiting:     4563 8958 851.5   9202    9354
Total:       4567 8962 851.4   9206    9358

Percentage of the requests served within a certain time (ms)
  50%   9206
  66%   9222
  75%   9249
  80%   9264
  90%   9315
  95%   9336
  98%   9347
  99%   9352
 100%   9358 (longest request)