tests/Load/results/search_c10_r1000_20260202_133038.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/bible/search?version=RV1960&query=amor
Document Length:        337105 bytes

Concurrency Level:      10
Time taken for tests:   91.113 seconds
Complete requests:      1000
Failed requests:        993
   (Connect: 0, Receive: 0, Length: 993, Exceptions: 0)
Non-2xx responses:      1000
Total transferred:      337371099 bytes
HTML transferred:       337135099 bytes
Requests per second:    10.98 [#/sec] (mean)
Time per request:       911.134 [ms] (mean)
Time per request:       91.113 [ms] (mean, across all concurrent requests)
Transfer rate:          3615.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    94  906  58.6    905    1004
Waiting:       90  902  58.6    901    1000
Total:         94  906  58.6    905    1004

Percentage of the requests served within a certain time (ms)
  50%    905
  66%    912
  75%    918
  80%    921
  90%    931
  95%    963
  98%    983
  99%    992
 100%   1004 (longest request)